function encoho()
{
  let inputOho = document.getElementById("inputOho").value;

  let choice = document.getElementById("choice");
  let checkValue = choice.elements['radio'].value;

  if (checkValue == "encode") {
    document.getElementById("outputOho").textContent = morseCodeToOho(textToMorseCode(inputOho));
  }
  if (checkValue == "decode") {
    document.getElementById("outputOho").textContent = morseCodeToText(ohoToMorseCode(inputOho));
  }


}

const hiraganaToMorse = {
    'あ': '.-', 'い': '..', 'う': '...', 'え': '.-..', 'お': '--',
    'か': '-.-.', 'き': '-.-..', 'く': '..-', 'け': '-.-', 'こ': '---',
    'さ': '---.', 'し': '--.-', 'す': '-.--', 'せ': '.---', 'そ': '---..',
    'た': '-.', 'ち': '..-.', 'つ': '.--.', 'て': '.-.', 'と': '..-..',
    'な': '-.--.', 'に': '.-.--', 'ぬ': '-..-', 'ね': '..--', 'の': '.-.-',
    'は': '-...', 'ひ': '--..-', 'ふ': '--.', 'へ': '.', 'ほ': '-..',
    'ま': '-..-', 'み': '..-.-', 'む': '-.', 'め': '-...', 'も': '-..-',
    'や': '.--', 'ゆ': '-..--', 'よ': '--',
    'ら': '...', 'り': '--...', 'る': '-.-', 'れ': '-.-..', 'ろ': '...',
    'わ': '.--.', 'を': '.-...', 'ん': '.-.-.',
    'が': '-.-..', 'ぎ': '--..', 'ぐ': '..-.', 'げ': '-.-.', 'ご': '---.',
    'ざ': '---.', 'じ': '--.-', 'ず': '-.--', 'ぜ': '.---', 'ぞ': '---..',
    'だ': '-.', 'ぢ': '..-.', 'づ': '.--.', 'で': '.-.', 'ど': '..-..',
    'ば': '-...', 'び': '--..-', 'ぶ': '--.', 'べ': '.', 'ぼ': '-..',
    'ぱ': '-...-', 'ぴ': '--..-..', 'ぷ': '--..', 'ぺ': '.', 'ぽ': '-..-.'
};

//const alphabetToMorse = {
//     'a': '.-', 'b': '-...', 'c': '-.-.', 'd': '-..', 'e': '.', 'f': '..-.', 'g': '--.', 'h': '....',
//     'i': '..', 'j': '.---', 'k': '-.-', 'l': '.-..', 'm': '--', 'n': '-.', 'o': '---', 'p': '.--.',
//     'q': '--.-', 'r': '.-.', 's': '...', 't': '-', 'u': '..-', 'v': '...-', 'w': '.--', 'x': '-..-',
//     'y': '-.--', 'z': '--..',
//     'A': '.-', 'B': '-...', 'C': '-.-.', 'D': '-..', 'E': '.', 'F': '..-.', 'G': '--.', 'H': '....',
//     'I': '..', 'J': '.---', 'K': '-.-', 'L': '.-..', 'M': '--', 'N': '-.', 'O': '---', 'P': '.--.',
//     'Q': '--.-', 'R': '.-.', 'S': '...', 'T': '-', 'U': '..-', 'V': '...-', 'W': '.--', 'X': '-..-',
//     'Y': '-.--', 'Z': '--..'
// };

const alphabetToMorse = {};

// ひらがなとアルファベットの両方をモールス信号に変換する連想配列を作成
const charToMorse = { ...hiraganaToMorse, ...alphabetToMorse };

const morseToOho ={
  '.': 'ア゛ォ', '-': 'ォォ', ' ': 'ンッ'
}

const ohoToMorse ={
  'ンッ': ' ', 'ォォ': '-', '.': '.'
}

const morseToHiragana = {
  '.-': 'あ', '..': 'い', '...': 'う', '.-..': 'え', '--': 'お',
  '-.-.': 'か', '-.-..': 'き', '..-': 'く', '-.-': 'け', '---': 'こ',
  '---.': 'さ', '--.-': 'し', '---.-': 'す', '.---': 'せ', '---..': 'そ',
  '-.': 'た', '..-.': 'ち', '.--.': 'つ', '.-.': 'て', '..-..': 'と',
  '-.--.': 'な', '.-.--': 'に', '-..-': 'ぬ', '..--': 'ね', '.-.-': 'の',
  '-...': 'は', '--..-': 'ひ', '--.': 'ふ', '.': 'へ', '-..': 'ほ',
  '-..-': 'ま', '..-.-': 'み', '-.': 'む', '-...': 'め', '-..-': 'も',
  '.--': 'や', '-..--': 'ゆ', '--': 'よ',
  '...': 'ら', '--...': 'り', '-.--.': 'る', '-.-..': 'れ', '...': 'ろ',
  '.--.': 'わ', '.-...': 'を', '.-.-.': 'ん'
};

// '-.-..': 'が', '--..': 'ぎ', '..-.': 'ぐ', '-.-.': 'げ', '---.': 'ご',
// '---.': 'ざ', '--.-': 'じ', '---.-': 'ず', '.---': 'ぜ', '---..': 'ぞ',
// '-.': 'だ', '..-.': 'ぢ', '.--.': 'づ', '.-.': 'で', '..-..': 'ど',
// '-...': 'ば', '--..-': 'び', '--.': 'ぶ', '.': 'べ', '-..': 'ぼ',
// '-...-': 'ぱ', '--..-..': 'ぴ', '--..': 'ぷ', '.': 'ぺ', '-..-.': 'ぽ'

// const morseToAlphabet = {
//   '.-': 'a', '-...': 'b', '-.-.': 'c', '-..': 'd', '.': 'e', '..-.': 'f', '--.': 'g', '....': 'h',
//   '..': 'i', '.---': 'j', '-.-': 'k', '.-..': 'l', '--': 'm', '-.': 'n', '----': 'o', '.--.': 'p',
//   '--.-': 'q', '.-.': 'r', '...': 's', '-': 't', '..-': 'u', '...-': 'v', '.--': 'w', '-..-': 'x',
//   '-.--': 'y', '--..': 'z',
//   '.-': 'A', '-...': 'B', '-.-.': 'C', '-..': 'D', '.': 'E', '..-.': 'F', '--.': 'G', '....': 'H',
//   '..': 'I', '.---': 'J', '-.-': 'K', '.-..': 'L', '--': 'M', '-.': 'N', '----': 'O', '.--.': 'P',
//   '--.-': 'Q', '.-.': 'R', '...': 'S', '-': 'T', '..-': 'U', '...-': 'V', '.--': 'W', '-..-': 'X',
//   '-.--': 'Y', '--..': 'Z'
// };

const morseToAlphabet = {};

// モールス信号からひらがなとアルファベットの両方に変換する連想配列を作成
const morseToChar = { ...morseToHiragana, ...morseToAlphabet };

// 文字列をモールス信号に変換する関数
function textToMorseCode(text) {
  return text.split('').map(char => charToMorse[char] || '').join(' ');
}

// モールス信号を文字列に復号する関数
function morseCodeToText(morseCode) {
  console.log(morseCode.split(' ').map(code => morseToChar[code] || '').join(''));
  return morseCode.split(' ').map(code => morseToChar[code] || '').join('');
}

// モールス信号をオホ声に変換する関数
function morseCodeToOho(text) {
  return (String(text)).split('').map(char => morseToOho[char] || '').join('');
}

//オホ声をモールス信号に変換する関数
function ohoToMorseCode(text){
  let newText = text.replace(/(ア゛ォ)/g, '.');
  console.log(newText);
  let newText2 = newText.replace(/(ォォ)/g,'-');
  console.log(newText2);
  console.log(newText2.replace(/(ンッ)/g,' '));
  return newText2.replace(/(ンッ)/g,' ');
}