function encoho()
{
  var inputOho = document.getElementById("inputOho").value;
  document.getElementById("outputOho").textContent = morseCodeToOho(textToMorseCode(inputOho));
}

const hiraganaToMorse = {
    'あ': '.-', 'い': '..', 'う': '...', 'え': '.-..', 'お': '--',
    'か': '-.-.', 'き': '-.-..', 'く': '..-', 'け': '-.-', 'こ': '---',
    'さ': '---.', 'し': '--.-', 'す': '-.--', 'せ': '.---', 'そ': '---..',
    'た': '-.', 'ち': '..-.', 'つ': '.--.', 'て': '.-.', 'と': '..-..',
    'な': '-.--.', 'に': '.-.--', 'ぬ': '-..-', 'ね': '..--', 'の': '.-.-',
    'は': '-...', 'ひ': '--..-', 'ふ': '--.', 'へ': '.', 'ほ': '-..',
    'ま': '-..-', 'み': '..-.-', 'む': '-.', 'め': '-...', 'も': '-..-',
    'や': '.--', 'ゆ': '-..--', 'よ': '--',
    'ら': '...', 'り': '--...', 'る': '-.-', 'れ': '-.-..', 'ろ': '...',
    'わ': '.--.', 'を': '.-...', 'ん': '.-.-.',
    'が': '-.-..', 'ぎ': '--..', 'ぐ': '..-.', 'げ': '-.-.', 'ご': '---.',
    'ざ': '---.', 'じ': '--.-', 'ず': '-.--', 'ぜ': '.---', 'ぞ': '---..',
    'だ': '-.', 'ぢ': '..-.', 'づ': '.--.', 'で': '.-.', 'ど': '..-..',
    'ば': '-...', 'び': '--..-', 'ぶ': '--.', 'べ': '.', 'ぼ': '-..',
    'ぱ': '-...-', 'ぴ': '--..-..', 'ぷ': '--..', 'ぺ': '.', 'ぽ': '-..-.'
};

const alphabetToMorse = {
    'a': '.-', 'b': '-...', 'c': '-.-.', 'd': '-..', 'e': '.', 'f': '..-.', 'g': '--.', 'h': '....',
    'i': '..', 'j': '.---', 'k': '-.-', 'l': '.-..', 'm': '--', 'n': '-.', 'o': '---', 'p': '.--.',
    'q': '--.-', 'r': '.-.', 's': '...', 't': '-', 'u': '..-', 'v': '...-', 'w': '.--', 'x': '-..-',
    'y': '-.--', 'z': '--..',
    'A': '.-', 'B': '-...', 'C': '-.-.', 'D': '-..', 'E': '.', 'F': '..-.', 'G': '--.', 'H': '....',
    'I': '..', 'J': '.---', 'K': '-.-', 'L': '.-..', 'M': '--', 'N': '-.', 'O': '---', 'P': '.--.',
    'Q': '--.-', 'R': '.-.', 'S': '...', 'T': '-', 'U': '..-', 'V': '...-', 'W': '.--', 'X': '-..-',
    'Y': '-.--', 'Z': '--..'
};

// ひらがなとアルファベットの両方をモールス信号に変換する連想配列を作成
const charToMorse = { ...hiraganaToMorse, ...alphabetToMorse };

const morseToOho ={
  '.': 'ア゛ォ', '-': 'ォォ'
}

// 文字列をモールス信号に変換する関数
function textToMorseCode(text) {
  return text.split('').map(char => charToMorse[char] || '').join(' ');
}

// モールス信号をオホ声に変換する関数
function morseCodeToOho(text) {
  return (String(text)).split('').map(char => morseToOho[char] || '').join('ンッ');
}